app/Http/Controllers/PesonaladgController.php

    public function DetallePuestos(Request $request)
    {
        $DetallePuestos =  DB::table('puestos')->where('id',$request->id_Puestos)->get();
---
select * from `puestos` where `id` = 1

    public function ActualizarPuestos(Request $request)
    {
        DB::table('puestos')->where('id',$request->id_Puestos)
            ->update(
                [
                    'nombre'  => $request->nombre
                ]
            );
---
update `puestos` set `nombre` = 'actualizado' where `id` = 42

    public function EliminarPuestos(Request $request)
    {
        DB::table('puestos')->where('id',$request->id_Puestos)
            ->delete();
---
delete from `puestos` where `id` = 42

    public function ActualizarArealaboral(Request $request)
    {
        DB::table('arealaboral')
            ->where('id',$request->id_Arealaboral) ->update(
                [
                    'nombre'  => $request->nombre
                ]
            );
---
update `arealaboral` set `nombre` = 'kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk' where `id` = 143

    public function EliminarArealaboral(Request $request)
    {
        DB::table('arealaboral')
            ->where('id',$request->id_Arealaboral)
            ->delete();
---
delete from `arealaboral` where `id` = 143