app/Http/Controllers/PesonaladgController.php

    public function DetalleArealaboral(Request $request)
    {
        $DetalleArealaboral =  DB::table('arealaboral')->where('id',$request->id_Arealaboral)->get();
---
select * from `arealaboral` where `id` = 1

    public function ListadoMunicipiolaboral()
    {
        $municipiolaboral =  DB::table('municipiolaboral')->get();
---
select * from `municipiolaboral`

    public function DetalleMunicipiolaboral(Request $request)
    {
        $DetalleMunicipiolaboral =  DB::table('municipiolaboral')->where('id',$request->id_Municipiolaboral)->get();
---
select * from `municipiolaboral` where `id` is null

    public function EliminarPersonalADG(Request $request)
    {
        DB::table('personaladg')
            ->where('personaladg.id', '=', $request->idPersonalADG)
            ->delete();
---
delete from `personaladg` where `personaladg`.`id` = 1715